// Unfortunately we cannot use Zig's multiline strings here because they do not support escape characters
// If we wanted to render an ASCII image with the same color/style all over, we could use multiline strings along with fmt.Decorated

pub const latte =
    "         \x1B[38;5;216;1m＿＿＿\n" ++
    "        \x1B[38;5;216;1m/フ    フ\n" ++
    "       \x1B[38;5;216;1m|   \x1B[38;5;255;1m_  _\x1B[38;5;216;1m⏐\n" ++
    "       \x1B[38;5;216;1m/\x1B[38;5;255;1mミ \x1B[38;5;216;1m＿\x1B[38;5;255;1mX\x1B[38;5;216;1mノ\n" ++
    "     \x1B[38;5;216;1m/       ⏐\n" ++
    "    \x1B[38;5;216;1m/  \\    ノ\n" ++
    "  \x1B[38;5;216;1m＿⏐  | |  |\n" ++
    " \x1B[38;5;216;1m/ _|   | |  |\n" ++
    " \x1B[38;5;216;1m| _\\＿_\\_)＿)\n" ++
    "  \x1B[38;5;216;1m\\_つ\n";

pub const cloudflare =
    " \x1B[38;5;208;1m                            ///\n" ++
    " \x1B[38;5;208;1m                      ///////////////\n" ++
    " \x1B[38;5;208;1m                   &///////////////////\n" ++
    " \x1B[38;5;208;1m            /////(//////////////////////\n" ++
    " \x1B[38;5;208;1m          /////////////////////////////// \x1B[38;5;216;1m***\n" ++
    " \x1B[38;5;208;1m          ////////////////////////////// \x1B[38;5;216;1m********#\n" ++
    " \x1B[38;5;208;1m     ////////////////////////////////,   \x1B[38;5;216;1m**********\n" ++
    " \x1B[38;5;208;1m   ///////////////,...                       \x1B[38;5;216;1m,******\n" ++
    " \x1B[38;5;208;1m  ///////////////////////////////////  \x1B[38;5;216;1m*************\n";

const apple = "";
